Repository: EmelSan/tmchat-ios
Catalog: tmChat/tmChat/Resources/*.lproj/Localizable.strings
Languages: tk

# hour_ago
source: an hour ago
tk: bir sagat mundan öň

# 2_4_hours_ago
source: hours ago
tk: sagat mundan öň

source: hours ago
tk: sagat mundan öň

# minute_ago
source: one minute ago
tk: bir minut mundan öň

# 2_4_minutes_ago
source: minutes ago
tk: minut mundan öň

source: minutes ago
tk: minut mundan öň

source: just now
tk: ýaňyja

source: Yesterday
tk: Düýn

source: Today
tk: Bu gün

# smth_went_wrong
source: Something went wrong
tk: Näsazlyklar ýüze çykdy

# referesh
source: Refresh
tk: Täzele

# no_connection
source: No connection. Check your connection and refresh
tk: Birikme ýok. Birikmäňizi barlaň we täzeläň

source: No content
tk: Maglumat ýok

source: Settings
tk: Sazlamalar

source: Like
tk: Hala

# likes
source: Liked
tk: Haladylar

source: Global search
tk: Global gözleg

# should_be_filled
source: Field is required
tk: Bu meýdança hökmany

source: Invalid phone number
tk: Nädogry telefon belgisi

source: Cancel
tk: Ýatyr

# msg_field_placeholder
source: Enter your message
tk: Habaryňyzy giriziň

# no_posts
source: No posts yet
tk: Entek post ýok

# tk
source: Turkmen
tk: Türkmen

# ru
source: Russian
tk: Rus

# en
source: English
tk: Iňlis

source: online
tk: onlaýn

# enter_your_complain
source: Enter your report
tk: Şikaýatyňyz giriziň

# enter_phone
source: Enter phone number
tk: Telefonyňyzy giriziň

# enter_phone_title
source: Welcome to TmChat!
tk: TmChat-a hoş geldiňiz!

# enter_phone_desc
source: Come up with a unique username so that users can communicate with you
tk: Girmek üçin telefon belgiňizi giriziň.

source: Continue
tk: Dowam et

# continue_in_en
source: Continue in English
tk: Iňlis dilinde dowam ediň

# continue_in_tk
source: Continue in Turkmen
tk: Türkmen dilinde dowam ediň

# enter_otp
source: Enter verification code
tk: Barlag koduny giriziň

# sent_to_phone
source: Verification code has been sent to
tk: Barlag kody iberildi

# resend_btn
source: Resend verification code
tk: Barlag kody iber

# resend_code_after
source: Resend verification code after:
tk: Barlag koduny iber:

source: Enter username
tk: Ulanyjy adyny giriziň

source: Enter name
tk: Adyny giriziň

source: Chats
tk: Söhbetler

source: Feed
tk: Lenta

source: Profile
tk: Profil

source: Could not delete
tk: Pozmakda näsazlyklar ýüze çykdy

source: New chat
tk: Täze söhbet

source: Read
tk: Oka

source: Mute
tk: Sesini öçür

source: Unmute
tk: Sesini aç

source: Delete
tk: Poz

source: Call
tk: JAň et

source: Search
tk: Gözle

source: More
tk: Ýene

source: Notifications
tk: Duýduryşlar

source: See my posts
tk: Postlarymy görmek

# images
source: Photos
tk: Suratlar

source: Videos
tk: Wideolar

# voice_msg
source: Voice messages
tk: Ses habarlary

source: Clear
tk: Arassala

# serach_user
source: Search user
tk: Ulanyjyny gözle

source: Send
tk: Iber

source: Selected:
tk: Saýlanan:

# chat_info
source: Chat information
tk: Söhbet barada maglumat

source: Search in chat
tk: Söhbedin içinden gözle

source: Clear Chat
tk: Söhbedi arassala

# take_img
source: Take image
tk: Surat al

source: File
tk: Faýl

source: Contact
tk: Kontakt

source: Location
tk: Geolokasiýa

source: Copied
tk: Göçürildi

source: Saved
tk: Ýatda saklandy

source: Could not save
tk: Ýatda saklmakda näsazlyklar çykdy

source: Could not download
tk: Ýüklemekde näsazlyklar çykdy

# new_post
source: Add post
tk: Post goş

# complain
source: Report
tk: Şikaýat

source: Delete post
tk: Posty poz

# could_not_add
source: Could not add post
tk: Posty goşmakda näsazlyklar ýüze çykdy

source: Attach
tk: Saýla

source: Add post
tk: Post goşmak

source: Comments
tk: Teswirler

source: Reactions
tk: Reaksiýalar

source: Publish
tk: Goş

# add_post_placeholder
source: Enter post description
tk: Postyň beýanyny ýaz

source: All
tk: Hemmesi

# contacts
source: Контакты
tk: Diňe kontaktlarym

source: Nobody
tk: Hiç kim

source: Private settings
tk: Hususy sazlamalar

# who_can_see_post
source: Select who can see your post
tk: Posty kim görüp biljekdigini saýlaň

source: Contact list
tk: Kontaktlaryň sanawy

# send_msg
source: Send message
tk: Habar ýaz

source: Post count
tk: Post sany

# open_edit
source: Edit profile
tk: Profili redaktirläň

source: Copy username
tk: Ulanyjy adyny göçüriň

# logout_title
source: Are you sure you want to logout?
tk: Siz hakykatdanam çykmak isleýärsiňizmi?

# logout_desc
source: After logout, all messages and chats would be removed from this device
tk: Çykandan soň ähli habarlar we söhbetdeşlikler bu enjamdan pozular

# delete_user
source: Are you sure you want to delete account?
tk: Siz hakykatdanam hasabyňyzy pozmak isleýärsiňizmi?

# delete_user_desc
source: After delete the account, your messages, chats and posts will be deleted
tk: Hasaby pozanyňyzdan soň habarlaryňyz, söhbetleriňiz we postlaryňyz pozular

# clear_cache
source: Are you sure you want to clear cache?
tk: Siz hakykatdanam keşi arassalamak isleýärsiňizmi?

# clear_cache_desc
source: All cache will be deleted from this device
tk: Bu enjamdan ähli keş keş ýok pozular

source: Update profile
tk: Profili täzeläň

source: Privacy
tk: Gizlinlik

# memory
source: Cache
tk: Keş

source: Language
tk: Dil

# delete_acc
source: Delete account
tk: Hasaby poz

source: Logout
tk: Çyk

source: About us
tk: Biz barada

# first_name
source: Name
tk: Adyňyz

# enter_first_name
source: Enter name
tk: Adyňyzy giriziň

# last_name
source: Surname
tk: Familiýaňyz

# enter_last_name
source: Enter surname
tk: Familiýaňyzy giriziň

source: Username
tk: Ulanyjy adyňyz

source: About me
tk: Men barada

# delete_no
source: No, do not delete
tk: Ýok, pozma

# delete_yes
source: Yes, delete
tk: Hawa, poz

# delete_room_title
source: Are you sure you want to delete dialog?
tk: Siz hakykatdanam söhbedi pozmak isleýärsiňizmi?

# delete_room_desc
source: After deletion you will not able to recover it
tk: Pozulandan soň ony dikeldip bilmersiňiz

source: App settings
tk: Goşundy sazlamalary

source: Account
tk: Hasap

# delete_post_title
source: Are you sure you want to delete post?
tk: Siz hakykatdanam posty pozmak isleýärsiňizmi?

source: Error
tk: Ýalňyşlyk

# in_server
source: Sent
tk: Iberildi

source: Delivered
tk: Gowşuryldy

source: Updating ...
tk: Täzelenýär ...

# otp_resent
source: Confirmation code has been resent
tk: Barlag kody tqzeden iberildi

# save_post_img
source: Save images of post
tk: Postyň suratlaryny ýükle

source: Invalid username
tk: Nädogry ulanyjy ady

# select_lang
source: Select language
tk: Dil saýla

source: Done
tk: Taýýar
